DataProcessors/ПоискСсылок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПоискСсылок</Name>
			<Comment>Выводятся объекты, в которых используется данный объект и объекты, которые используются в данном объекте</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Comment>Хранит ссылку на объект по которому будут осуществляться поиск.</Comment>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСсылокИспользует</Name>
					<Comment>Ссылки использованные в объекте. Список собран из не пустых ссылочных реквизитов объекта.</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСсылокИспользуется</Name>
					<Comment>Список ссылок на объекты конфигурации в которых используется выбранный объект</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПоискСсылок/Ext/ObjectModule.bsl
// Поиск Ссылок на данный объект из других объектов
//
// Параметры:
//  ЭтаФорма - ссылка на форму
//
Процедура НайтиВходящие(ЭтаФорма = Неопределено) Экспорт 
	Если ЭтаФорма = Неопределено Тогда
		ФормаОтчета = ЭтотОбъект.ПолучитьФорму();			
	Иначе
		ФормаОтчета = Неопределено;
	КонецЕсли;
	СписокСсылокИспользуется = Новый ТаблицаЗначений;
	СписокСсылокИспользуется.Колонки.Добавить("Объект",Новый ОписаниеТипов(),"Объект");
	СписокСсылокИспользуется.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"),"Тип");	
	СписокСсылокИспользуется.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"),"Дата");	
	
	Если ОбъектСсылка<>Неопределено Тогда
		МассивПоиска=Новый Массив(1);
		МассивПоиска[0]=ОбъектСсылка.Ссылка;
		ТаблицаСсылок = НайтиПоСсылкам(МассивПоиска);
		СписокСсылокИспользуется.Очистить();
		//Гэндальф+++
		МассивПоиска=Новый Массив;
		Если ТипЗнч(ОбъектСсылка.Ссылка) = Тип("СправочникСсылка.Автомобили")  тогда
			Флаг = Истина;
		Иначе
			Флаг = Ложь;
		КонецЕсли;	

		//Гэндальф---
		Для Каждого Элемент Из ТаблицаСсылок Цикл
		  Если Элемент.Данные<>ОбъектСсылка Тогда   		                               		  	
		  	Строка = СписокСсылокИспользуется.Добавить();
			Строка.Объект = Элемент[1];			
			Строка.Тип = ТипЗнч(Элемент[1]);
			Попытка
				Строка.Дата = Элемент.Данные.Дата;
			Исключение
			КонецПопытки;
			//Гэндальф+++
			Если Флаг тогда
				Если ТипЗнч(Элемент.Данные)  = Тип("ДокументСсылка.ПоступлениеАвтомобилей") тогда
					 МассивПоиска.Добавить(Элемент[1]);

				КонецЕсли;	
			КонецЕсли;	
			//Гэндальф---
		  КонецЕсли; 		
	    КонецЦикла; 
	    //Гэндальф+++
		ТаблицаСсылок = НайтиПоСсылкам(МассивПоиска);
        Для Каждого Элемент Из ТаблицаСсылок Цикл
		  Если Элемент.Данные<>ОбъектСсылка и ТипЗнч(Элемент.Данные)  = Тип("ДокументСсылка.Выписка")  Тогда   		                               		  	
		  	Строка = СписокСсылокИспользуется.Добавить();
			Строка.Объект = Элемент[1];			
			Строка.Тип = ТипЗнч(Элемент[1]);
			Попытка
				Строка.Дата = Элемент.Данные.Дата;
			Исключение
			КонецПопытки;
		  КонецЕсли; 		
	    КонецЦикла; 
		//Гэндальф---
	  
	КонецЕсли;
	
	СписокСсылокИспользуется.Сортировать("Дата");
	
	Если ФормаОтчета <> Неопределено И НЕ ФормаОтчета.Открыта() Тогда
		ФормаОтчета.Открыть();
	КонецЕсли;	 
КонецПроцедуры // НайтиВходящие()

// Поиск Ссылок которые используются в данном объекте
//
// Параметры:
//  ЭтаФорма - ссылка на форму
//
Процедура НайтиИсходящие(ЭтаФорма = Неопределено) Экспорт 
	Если ЭтаФорма = Неопределено Тогда
		ФормаОтчета = ЭтотОбъект.ПолучитьФорму();			
	Иначе
		ФормаОтчета = Неопределено;
	КонецЕсли;
    
	СписокСсылокИспользует = Новый ТаблицаЗначений;
	СписокСсылокИспользует.Колонки.Добавить("Объект",Новый ОписаниеТипов(),"Объект");
	СписокСсылокИспользует.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"),"Тип");

    Если ОбъектСсылка<>Неопределено Тогда		
		ВидДок = ОбъектСсылка.Метаданные().Имя;		
		МассивТипов=Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		МассивТипов.Добавить(Тип("Число"));
		МассивТипов.Добавить(Тип("Дата"));
		МассивТипов.Добавить(Тип("Булево"));
		ОписаниеТиповДок = Новый ОписаниеТипов(МассивТипов,,,);    
		
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) ИЛИ
				  ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		Иначе 
			Сообщить("Поиск по данному типу ссылки не определен");
			Возврат;
		КонецЕсли;
		Для Каждого Реквизит Из КоллекцияРеквизитов Цикл
			ЗнРеквизит = ОбъектСсылка[Реквизит.Имя];
			Если НЕ обЗначениеНеЗаполнено(ЗнРеквизит) И (Не ОписаниеТиповДок.СодержитТип(ТипЗнч(ЗнРеквизит))) Тогда
				    Строка = СписокСсылокИспользует.Добавить();
					Строка.Объект = ЗнРеквизит;
					Строка.Тип = ТипЗнч(ЗнРеквизит);
			КонецЕсли;
		КонецЦикла; 			
	КонецЕсли;
	Если ФормаОтчета <> Неопределено И НЕ ФормаОтчета.Открыта() Тогда
		ФормаОтчета.Открыть();
	КонецЕсли;
КонецПроцедуры // НайтиИсходящие()
